FemDesign.Supports.Group
support_rigidity_data_type --> group

FemDesign.Supports.Group.#ctor
Parameterless constructor for serialization.

FemDesign.Supports.Group.#ctor(FemDesign.Geometry.CoordinateSystem,FemDesign.Releases.Motions,FemDesign.Releases.Rotations)
Constructor by edge and rigidity. Used to create group for line support

FemDesign.Supports.Group.#ctor(FemDesign.Geometry.CoordinateSystem,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits)
Constructor by edge and rigidity. Used to create group for line support

FemDesign.Supports.Group.#ctor(FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits)
Constructor by edge and rigidity. Used to create group for point support

FemDesign.Supports.Group.#ctor(FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Releases.Motions,FemDesign.Releases.Rotations)
Constructor by vectors and rigidity. Used to create group for point support